//Задача 64: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//M = 1; N = 5. -> ""1, 2, 3, 4, 5""
//M = 4; N = 8. -> ""4, 6, 7, 8""
/*int m=1;
int n=5;
int i= m;
string s = $" "; ;
for (i=m; i<(n+1); i++)
{
    s += $"{i}, ";
    
}
Console.WriteLine(s);*/
//Задача 66: Задайте значения M и N. Напишите программу, 
//которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
//M = 4; N = 8. -> 30
/*int m=4;
int n=8;
int i= m;
int s = 0;
for (i=m; i<(n+1); i++)
{
    s +=i;
    
}
Console.WriteLine(s);*/
//Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. 
//Даны два неотрицательных числа m и n.
//m = 2, n = 3 -> A(m,n) = 29
Console.Write("Введите число n: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число m: ");
int m = Convert.ToInt32(Console.ReadLine());
int a=0;
if (n == 0) a=n + 1;
if (n != 0 && m == 1) a= n + 1;
if (n > 0 && m == 2) a= 2*n + 3;
                
Console.WriteLine(a);
//a