//Напишите метод, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
/*
int k = Step(2,4);
int n = Step (3,4);    
Console.WriteLine($"chislo {k}");
Console.WriteLine($"chislo {n}");


int Step(int a, int b)
{
    int c = 1;
    for (int i=0; i < b; i++)
    {
        c*=a;
    }
       
    return c;   
}
*/
// Напишите метод, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

/*int Tsep(int a)

{   int c=0;
    for (int i=0; i<3; i++)
    {
        int z=a % 10;
        int a1=a/10;
        int x=a1 % 10;
        int a2= a1/10;
        int h=a2%10;
        int a3=a2/10;
        int l=a3%10;
        c=z+h+x+l;
    }
    return c;
      
}

int r =Tsep(452);
int t =Tsep(82);
int y =Tsep(9012);
Console.WriteLine(r);
Console.WriteLine(t);
Console.WriteLine(y);

*/

Console.WriteLine($"chislo {c}");
