/*Задача 25: Напишите метод, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16
*/
/* 
Console.WriteLine("vved a");
int a = Console.Read();
Console.WriteLine("vved a");
int b = Console.Read();


void Print(int[] array)
{
    int i=0;
    int c = a;
    for (i=0; i<b; i++)
    c*=a;
    i++;
}
Console.WriteLine($"chislo {c}");*/
/*Задача 27: Напишите метод, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12*/
/*Console.WriteLine("vved a");
int a = Console.Read();
int b = 0;
int c =0;
int i =0;
int IndexOf(int a, int b) 
{
    for (i=0; i < 10; i++)
     c=10*i;
     b+=a%c;
     i++;
}
Console.Write(b);*/

/*Задача 29: Напишите метод(ы), которай задаёт массив из 8 элементов и выводит их на экран.
1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
6, 1, 33 -> [6, 1, 33]*/
Console.WriteLine("vved 8 chisel");
int i=0;
int a0 = Console.Read(); int a2 = Console.Read(); int a4 = Console.Read(); int a6 = Console.Read();
int a1 = Console.Read(); int a3 = Console.Read(); int a5 = Console.Read(); int a7 = Console.Read();
string IndexOf(int[], Array)
for (i=0; i<8; i++)
{
    string s [i]= a[i]+',';
    i++;
}
Console.WriteLine(string s)

